[
    {
        "name": "Thorin II Oakenshield",
        "description": "In the year TA 2746, Thorin II was born to Dwarven prince Thráin II in the mountain city of The Lonely Mountain. Early in his youth, he and the other Dwarves of the Lonely Mountain were forced to flee by the dragon Smaug in TA 2770. While in exile, he quickly grew to become a capable warrior. This was demonstrated when he participated in the Battle of Azanulbizar in TA 2799. He marched with one of the Dwarven armies beneath the East-gate of Moria. At some point in the fighting, his shield broke, and using an oaken tree branch found on the floor as a shield, he gained the epithet 'Oakenshield,' which would remain with him even in death.",
        "image_source": "http://pm1.narvii.com/6281/332097d154b6c9df0eefb74914e2be4f54464df9_00.jpg",
        "url": "thorin-ii-oakenshield"
    },
    {
        "name": "Fíli and Kíli",
        "description": "Fíli and Kíli were nephews of Thorin, who was the elder brother of their mother Dís. They were also nephews of Frerin, grandsons of Thráin II, and great-grandsons of Thrór. Fíli's most distinguishing feature was his long nose, the longest of any of the Dwarves in Thorin's company.",
        "image_source": "https://i.pinimg.com/736x/f0/7c/83/f07c834363f01e4b9ae89b50bc5b869a.jpg",
        "url": "fili-and-kili"
    },
    {
        "name": "Óin",
        "description": "Óin was the older brother of Glóin, cousin of Dwalin and Balin, and uncle of Gimli. Oin's uncle was King Fundin, the father of Balin and Dwalin. He usually wore a brown-hooded cloak when travelling. Óin fought in the Battle of Azanulbizar along with Thorin Oakenshield, and in TA 2941 joined with Thorin and Company on the quest to reclaim the Lonely Mountain wearing a brown hood.[2] Óin was one of the Dwarves who bet that Bilbo would come along with them to reclaim the Lonely Mountain. Óin and his brother Glóin were usually in charge of preparing the fire for the Company as they were the most skilled out of the others. He fought in and survived the Battle of the Five Armies, and later settled in the Lonely Mountain with King Dain Ironfoot II along with many other dwarves of The Company of Thorin.",
        "image_source": "https://static.wikia.nocookie.net/hobbitlotrtrilogy/images/a/af/Oin.png",
        "url": "oin"
    },
    {
        "name": "Glóin",
        "description": "Glóin was born in TA 2783, after the Dragon Smaug desolated Erebor. He was the younger child of Gróin and younger brother of Óin. In TA 2799, Glóin was known to have fought in the Battle of Azanulbizar, the last battle of the War of the Dwarves and Orcs, though it is unknown what significance he did, being 16 years old.",
        "image_source": "http://www.councilofelrond.com/wp-content/uploads/modules/My_eGallery/gallery/characters/other/misccreats/cadw_001ccgdwarfguard.jpg",
        "url": "gloin"
    },
    {
        "name": "Balin",
        "description": "Balin was likely born in the Lonely Mountain before the coming of the dragon Smaug. He had a younger brother named Dwalin, and was amongst those driven from their homes when Smaug attacked the Lonely Mountain. Afterwards, he may have lived in Dunland as a refugee, before fighting in the War of the Dwarves and Orcs which culminated in the Battle of Azanulbizar. Many years later, in approximately TA 2841, he accompanied Thráin II, the father of Thorin, when he attempted to go back to the Lonely Mountain himself, but Thráin was captured and lost.",
        "image_source": "https://fictionhorizon.com/wp-content/uploads/2020/03/The-hobbit1-movie-screencaps.com-10417-1-1024x539.jpg",
        "url": "balin"
    },
    {
        "name": "Dwalin",
        "description": "Born in TA 2772, two years after the dragon Smaug had desolated Erebor, Dwalin was the son of Fundin and younger brother of Balin. After fighting in the Battle of Azanulbizar at the age of 27, Dwalin accompanied Thrain the Second and Thorin Oakenshield to settle peacefully in the northern Ered Luin.",
        "image_source": "https://img1.looper.com/img/gallery/heres-why-dwalin-from-the-hobbit-looks-so-familiar/intro-1612537139.jpg",
        "url": "dwalin"
    },
    {
        "name": "Ori",
        "description": "Ori lived in Thorin's Halls in the northern Blue Mountains for many years. In the year TA 2941, Ori became a member of Thorin's Company and travelled with Thorin, Gandalf, Bilbo Baggins, and the other dwarves on the quest for the Lonely Mountain, culminating in the death of Smaug. Finally, he and the other dwarves of Thorin's Company fought in the Battle of Five Armies, which he survived.",
        "image_source": "https://static.wikia.nocookie.net/lotr/images/8/81/Ori.jpeg",
        "url": "ori"
    },
    {
        "name": "Dori",
        "description": "Dori was a Dwarf of Durin's Folk, who, along with his brother Nori and cousin Ori,[1] travelled with Bilbo Baggins and Thorin Oakenshield as a member of Thorin's Company on the Quest for Erebor, to reclaim the Lonely Mountain from the dragon Smaug.",
        "image_source": "https://static.wikia.nocookie.net/lotr/images/2/2e/07_dori-copy.jpeg",
        "url": "dori"
    },
    {
        "name": "Nori",
        "description": "Nori was a Dwarf of Durin's Folk. He had a brother named Dori as well as a cousin named Ori,[1] and was a remote kinsman of Thorin Oakenshield. His hood was purple, he played the flute, and he was very fond of regular and plentiful meals like his hobbit friend, Bilbo Baggins.",
        "image_source": "https://static.wikia.nocookie.net/pjhobbitfilms/images/7/7b/Nori.png",
        "url": "nori"
    },
    {
        "name": "Bifur",
        "description": "Bifur was a Dwarf of the late-Third Age. He is best known for being a companion to Bilbo Baggins and Thorin Oakenshield on the quest to regain the Lonely Mountain, along with his cousins Bofur and Bombur.",
        "image_source": "https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/ec8667dd-c725-47a3-8852-73e34d2a16eb/d9ngkan-672acd1b-e501-4aee-8655-74749874ef50.jpg/v1/fill/w_1024,h_702,q_75,strp/bifur__dazed_and_confused_dwarf_by_barbarian_j_d9ngkan-fullview.jpg?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOiIsImlzcyI6InVybjphcHA6Iiwib2JqIjpbW3siaGVpZ2h0IjoiPD03MDIiLCJwYXRoIjoiXC9mXC9lYzg2NjdkZC1jNzI1LTQ3YTMtODg1Mi03M2UzNGQyYTE2ZWJcL2Q5bmdrYW4tNjcyYWNkMWItZTUwMS00YWVlLTg2NTUtNzQ3NDk4NzRlZjUwLmpwZyIsIndpZHRoIjoiPD0xMDI0In1dXSwiYXVkIjpbInVybjpzZXJ2aWNlOmltYWdlLm9wZXJhdGlvbnMiXX0.bCzBIIwOiQe1eQMlLXTh5pAEx5Cb2e8dUAx3pvPc2II",
        "url": "bifur"
    },
    {
        "name": "Bofur",
        "description": "Bofur was a Dwarf of the late-Third Age. He is best known for being companions to Bilbo Baggins, Thorin Oakenshield and Gandalf on the quest to reclaim Lonely Mountain from the dragon Smaug, along with his brother Bombur and cousin Bifur.",
        "image_source": "https://i.pinimg.com/originals/af/ed/d8/afedd841b5bec756891f6bb5fa9f49c2.jpg",
        "url": "bofur"
    },
    {
        "name": "Bombur",
        "description": "Bombur was a Dwarf who accompanied Thorin Oakenshield and Bilbo Baggins on their journey to the Lonely Mountain as part of the company, alongside his brother Bofur and cousin Bifur. Bombur was noted as the fattest Dwarf in the company.",
        "image_source": "https://i.pinimg.com/originals/d3/a7/71/d3a77178de026449ce8799dece714b18.jpg",
        "url": "bombur"
    },
    {
        "name": "Gandalf",
        "description": "Gandalf (Norse; IPA: [gand:alf] - 'Elf of the Wand' or 'Wand-elf') the Grey, later known as Gandalf the White, and originally named Olórin (Quenya; IPA: [oˈloːrin] - 'Dreamer' or 'Of Dreams'), was an Istar (Wizard), dispatched to Middle-earth in the Third Age to combat the threat of Sauron. He joined Thorin and his company to reclaim the Lonely Mountain from Smaug, convoked the Fellowship of the Ring to destroy the One Ring, and led the Free Peoples in the final campaign of the War of the Ring.",
        "image_source": "https://i.pinimg.com/originals/43/37/b0/4337b0de83726e81eb5a6a37c1e6b309.jpg",
        "url": "gandalf"
    }
]